src/ПодсистемаPAPI/InformationRegisters/PAPI_ЗапросНедостающихДанных.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>PAPI_ЗапросНедостающихДанных</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ВходящийИдентификатор</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КодОтправителя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ДатаОтправки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипСообщения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипОбъекта</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдОбъекта</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>40</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Представление</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДанныеПрочитаны</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаЧтения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекстОшибки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1024</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Идентификатор</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/ПодсистемаPAPI/Enums/PAPI_ТипЛога.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>PAPI_ТипЛога</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Информация</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Ошибка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Предупреждение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Примечание</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/ПодсистемаPAPI/InformationRegisters/PAPI_ЗапросНедостающихДанных/Ext/ManagerModule.bsl
#Область СлужебныеПроцедурыИФункции

// Функция - Добавить изменить запись
//
// Параметры:
//  СтруктураЗаписи	 - Структура - 
// 
// Возвращаемое значение:
//  Результат - Булево 
//
Функция ДобавитьИзменитьЗапись(СтруктураЗаписи, Создавать = Истина) Экспорт

	Результат = Ложь;
	
	ВключенПривилегированныйРежим = Ложь;
	Если Не ПривилегированныйРежим() Тогда  
		ВключенПривилегированныйРежим = Истина;
		УстановитьПривилегированныйРежим(ВключенПривилегированныйРежим);
	КонецЕсли;	 
	
	
	Если ТипЗнч(СтруктураЗаписи) <> Тип("Структура") Тогда
		
		ТекстОшибки = НСтр("ru = 'Запись не является Структурой'; en = 'Record is not a Structure'");		
		PAPI_Логирование.ЗаписатьВЛог("PAPI.Ошибка", Перечисления.PAPI_ТипЛога.Ошибка, ТекстОшибки, "РегистрыСведений.PAPI_ЗапросНедостающихДанных");
		
		Возврат Результат; 
		
	КонецЕсли;
	
	Если Не СтруктураЗаписи.Свойство("Идентификатор") Тогда 
		                                        
		ТекстОшибки = НСтр("ru = 'Отсутствует свойство ""Идентификатор""'; en = 'Identifier property is missing'");
		PAPI_Логирование.ЗаписатьВЛог("PAPI.Ошибка", Перечисления.PAPI_ТипЛога.Ошибка, ТекстОшибки, "РегистрыСведений.PAPI_ЗапросНедостающихДанных");
		
		Возврат Результат;		
		
	КонецЕсли;	
	
	Если Не ЗначениеЗаполнено(СтруктураЗаписи.Идентификатор) Тогда 
		                                        
		ТекстОшибки = НСтр("ru = 'Не заполнен ""Идентификатор""'; en = 'Identifier not filled in'");
		PAPI_Логирование.ЗаписатьВЛог("PAPI.Ошибка", Перечисления.PAPI_ТипЛога.Ошибка, ТекстОшибки, "РегистрыСведений.PAPI_ЗапросНедостающихДанных");
		
		Возврат Результат;		
				
	КонецЕсли;	
	
	НаборЗаписей = РегистрыСведений.PAPI_ЗапросНедостающихДанных.СоздатьНаборЗаписей(); 
	НаборЗаписей.Отбор.Идентификатор.Установить(СтруктураЗаписи.Идентификатор);
	
	НаборЗаписей.Прочитать();
	
	Если НаборЗаписей.Количество() = 0 Тогда
		
		Если Не Создавать Тогда 
			Возврат Истина;	
		КонецЕсли;	
		
		НоваяЗаписьРегистра = НаборЗаписей.Добавить();  		
		МассивПолейРегистра = МассивПолейРегистра();		
	
	Иначе // НаборЗаписей.Количество() > 0
				
		НоваяЗаписьРегистра = НаборЗаписей[0]; 	
		МассивПолейРегистра = МассивПолейИзмененияРегистра();	
		
	КонецЕсли;
	
	Попытка
		
		Для Каждого элМассива Из МассивПолейРегистра Цикл 
				
			Если СтруктураЗаписи.Свойство(элМассива) Тогда
				
				НоваяЗаписьРегистра[элМассива] = СтруктураЗаписи[элМассива];
					
			КонецЕсли	
			
		КонецЦикла;
		
		НаборЗаписей.ДополнительныеСвойства.Вставить("PAPIОтключитьПодпискуПередЗаписью");
		
		НаборЗаписей.Записать();
		Результат = Истина;
		
	Исключение

		ТекстОшибки = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());		
		PAPI_Логирование.ЗаписатьВЛог("PAPI.Ошибка", Перечисления.PAPI_ТипЛога.Ошибка, ТекстОшибки, "РегистрыСведений.PAPI_ЗапросНедостающихДанных");						
					
	КонецПопытки;
		
	Если ВключенПривилегированныйРежим Тогда 
		ВключенПривилегированныйРежим = Ложь;
		УстановитьПривилегированныйРежим(ВключенПривилегированныйРежим);	
	КонецЕсли;
	
	Возврат Результат; 
	
КонецФункции


// Функция - Получить идентификатор входящего запроса
//
// Параметры:
//  Идентификатор	 - Уникальный идентификатор	 - Идентификатор запроса недостающих данных
// 
// Возвращаемое значение:
//  Результат - Структура
//
Функция ПолучитьИдентификаторВходящегоЗапроса(Идентификатор) Экспорт 

    Результат = Новый Структура("Отработал, ТекстОшибки", Истина, "");
	
	ВключенПривилегированныйРежим = Ложь;
	Если Не ПривилегированныйРежим() Тогда  
		ВключенПривилегированныйРежим = Истина;
		УстановитьПривилегированныйРежим(ВключенПривилегированныйРежим);
	КонецЕсли;	
	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	PAPI_ЗапросНедостающихДанных.ВходящийИдентификатор КАК ВходящийИдентификатор,
		|	PAPI_ЗапросНедостающихДанных.КодОтправителя КАК КодОтправителя
		|ИЗ
		|	РегистрСведений.PAPI_ЗапросНедостающихДанных КАК PAPI_ЗапросНедостающихДанных
		|ГДЕ
		|	PAPI_ЗапросНедостающихДанных.Идентификатор = &Идентификатор";
	
	Запрос.УстановитьПараметр("Идентификатор", Идентификатор);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда 
		Результат.Вставить("Результат", Новый Структура("ВходящийИдентификатор,КодОтправителя", 
			ВыборкаДетальныеЗаписи.ВходящийИдентификатор, ВыборкаДетальныеЗаписи.КодОтправителя));
	Иначе
		Результат.Отработал = Ложь;
		Результат.ТекстОшибки = НСтр("ru = 'Данные входящего пакета отсутствуют.'; en = 'Incoming packet data missing.'")

	КонецЕсли;
	
	Если ВключенПривилегированныйРежим Тогда 
		ВключенПривилегированныйРежим = Ложь;
		УстановитьПривилегированныйРежим(ВключенПривилегированныйРежим);	
	КонецЕсли;
	
	Возврат Результат;

КонецФункции	

// Функция - Нет запросов недостающих данных
//
// Параметры:
//  ВходящийИдентификатор	 - УникальныйИдентификатор - Идентификатор из Регистра сведений PAPI_ВходящиеСообщенияСервисаИнтеграции
//  КодОтправителя			 - Строка - КодОтправителя из Регистра сведений PAPI_ВходящиеСообщенияСервисаИнтеграции
// 
// Возвращаемое значение:
//  Результат - Булево 
//
Функция ЕстьЗапросыНедостающихДанных(ВходящийИдентификатор, КодОтправителя) Экспорт 
	
	Результат = Ложь;
	
	ВключенПривилегированныйРежим = Ложь;
	Если Не ПривилегированныйРежим() Тогда  
		ВключенПривилегированныйРежим = Истина;
		УстановитьПривилегированныйРежим(ВключенПривилегированныйРежим);
	КонецЕсли;	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	PAPI_ЗапросНедостающихДанных.Идентификатор КАК Идентификатор
		|ИЗ
		|	РегистрСведений.PAPI_ЗапросНедостающихДанных КАК PAPI_ЗапросНедостающихДанных
		|ГДЕ
		|	PAPI_ЗапросНедостающихДанных.ВходящийИдентификатор = &ВходящийИдентификатор
		|	И PAPI_ЗапросНедостающихДанных.КодОтправителя = &КодОтправителя
		|	И НЕ PAPI_ЗапросНедостающихДанных.ДанныеПрочитаны";
	
	Запрос.УстановитьПараметр("ВходящийИдентификатор", ВходящийИдентификатор);
	Запрос.УстановитьПараметр("КодОтправителя", КодОтправителя);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда 
		Результат = Истина;
	КонецЕсли;
	
	Если ВключенПривилегированныйРежим Тогда 
		ВключенПривилегированныйРежим = Ложь;
		УстановитьПривилегированныйРежим(ВключенПривилегированныйРежим);	
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции	


// Функция - Массив полей регистра
// 
// Возвращаемое значение:
//  Массив - Поля заполняемые при создании записи
//
Функция МассивПолейРегистра()
	
	МассивПолейРегистра = Новый Массив;  
	
	// Измерения
	МассивПолейРегистра.Добавить("Идентификатор");
	
	// Стандартные свойства сообщения
	МассивПолейРегистра.Добавить("ВходящийИдентификатор");
	МассивПолейРегистра.Добавить("КодОтправителя");
	
	// Параметры с информацией по обмену
    МассивПолейРегистра.Добавить("ДатаОтправки");
	МассивПолейРегистра.Добавить("ТипСообщения");
	МассивПолейРегистра.Добавить("ТипОбъекта");
	МассивПолейРегистра.Добавить("ИдОбъекта");
	МассивПолейРегистра.Добавить("Представление");
	
	// Отметка о прочтении
	МассивПолейРегистра.Добавить("ДанныеПрочитаны");
	МассивПолейРегистра.Добавить("ДатаЧтения"); 
	
	// Ошибка записи
	МассивПолейРегистра.Добавить("ТекстОшибки");
	
	Возврат МассивПолейРегистра;
	
КонецФункции

// Функция - Массив полей изменения регистра
// 
// Возвращаемое значение:
//  Массив - Поля заполняемые при создании записи 
//
Функция МассивПолейИзмененияРегистра()
	
	МассивПолейРегистра = Новый Массив;
	МассивПолейРегистра.Добавить("ДанныеПрочитаны");
	МассивПолейРегистра.Добавить("ДатаЧтения");
	
	МассивПолейРегистра.Добавить("ТекстОшибки");
	
	Возврат МассивПолейРегистра;
	
КонецФункции


#КонецОбласти
